---
kind: other
id: Methods.T:Autodesk.Revit.UI.ExternalApplicationArrayIterator
source: html/2e4ca360-4369-8daa-4a24-3339fde5698d.htm
---
# ExternalApplicationArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.